{
  "backend/main.mo": "Motoko canister storing submitted contact messages with validation and functions to submit, clear, and retrieve messages.",
  "feature_evidence.json": "Report mapping feature updates to affected frontend component files with metadata for tracking and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of each main frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens for light and dark modes plus global styles.",
  "frontend/index.html": "HTML entry point setting document metadata and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps HomePage with React Query and theme providers and includes toast notifications.",
  "frontend/src/components/AboutSection.tsx": "Animated two-column About section describing the developer and ICP benefits with feature icons.",
  "frontend/src/components/ContactSection.tsx": "Contact form with validation, backend submission via React Query, animations, and social links excluding GitHub.",
  "frontend/src/components/Footer.tsx": "Simple footer showing static attribution text.",
  "frontend/src/components/HeroSection.tsx": "Hero section with parallax background, headline, subtitle, and animated three-step process cards.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with scroll detection, smooth section scrolling, and mobile menu toggle.",
  "frontend/src/components/PortfolioSection.tsx": "Displays a grid of animated project cards with tier-based styling and images triggered by intersection observer.",
  "frontend/src/components/PricingSection.tsx": "File is empty and contains no implementation.",
  "frontend/src/components/ServicesSection.tsx": "Renders a services section with fade-in animations and descriptive text about custom business applications.",
  "frontend/src/contexts/LanguageContext.tsx": "File is empty and contains no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, including login, logout, identity loading, and status management.",
  "frontend/src/hooks/useInView.ts": "Custom hook using IntersectionObserver to report when an element enters or leaves the viewport.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook that submits a message through the backend actor and refreshes message queries.",
  "frontend/src/index.css": "Tailwind config and CSS variables defining light/dark themes, brand colors, and utility animations.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling all sections and tracking active section based on scroll position for navigation highlighting.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, current feature updates, pending requests, and details for modifying text and removing a GitHub link in a portfolio site."
}